package com.training;

// wtfkin bfs(너비우선탐색 알고리즘) is
// 가장 먼저 도달한 칸(노드)가 최단경로임.
// 시작지점에서 가장 가까이에 있는 칸들을 모두 방문 후 멀리 이동함.

public class Solution030_2 {
	
	/* BFS의 주요 개념
	 * 1. 탐색 방식
	 * 	BFS는 시작 지점부터 탐색을 시작.
	 * 	먼저 가까운 칸(노드)를 모두 방문한 뒤, 더 먼 노드로 이동함
	 * 	트리나 그래프를 층(layer) 단위로 탐색하는 것과 비슷
	 * 
	 * 2. FIFO 방식
	 * 	BFS는 큐(Queue) 자료구조를 사용하여 탐색할 노드(칸)을 관리함
	 * 	큐는 FIFO원칙을 따르므로, 먼저 탐색해야 할 노드가 먼저 처리됨
	 * 
	 * 3. 최단 경로 보장
	 * 	가중치가 없는 그래프에서 BFS는 탐색 과정에서 처음 도달한 경로가
	 *  최단 경로임을 보장함.
	 *  
	 * 
	 * 
	 * 
	 * 
	 * 
	 * 
	 * */
	
}
